OpenFOAM_6/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/Allrun
#!/bin/sh
cd ${0%/*} || exit 1 # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Meshing
runApplication blockMesh
runApplication topoSet
runApplication splitMeshRegions -cellZones -overwrite
runApplication decomposePar -copyZero -allRegions

# Simulation
runParallel $(getApplication)

# Reconstruct
runApplication reconstructPar -allRegions

# Post-process
paraFoam -touchAll

#------------------------------------------------------------------------------
